<template>
    <div class="slider">
        <Carousel :settings="settings" :breakpoints="breakpoints">
          <Slide  v-for="slide in slides" :key="slide.index">
            <div class="slider-item">
                <div class="slider-item__cnt">
                    <img :src="slide.images" alt="">
                    <h1>{{ slide.title }}</h1>
                    <p>{{ slide.info }}</p>
                    <p>{{ slide.info1 }}</p>
                    <p>{{ slide.info2 }}</p>
                    <p>{{ slide.info3 }}</p>
                    <p>{{ slide.info4 }}</p>
                    <p>{{ slide.info5 }}</p>
                    <p>{{ slide.info6 }}</p>
                    <p>{{ slide.info7 }}</p>
                </div>
            </div>
          </Slide>
          <template #addons>
            <Navigation />
          </template>
        </Carousel>
    </div>
</template>

<script>
import { defineComponent } from 'vue'
import { Carousel, Navigation, Slide } from "vue3-carousel"

import 'vue3-carousel/dist/carousel.css'

export default defineComponent({
    components: {
        Carousel,
        Slide,
        Navigation
    },
    data: () => ({
            settings: {
                itemsToShow: 5,
                snapAlign: 'center',
            },
            breakpoints: {
            // 700px and up
            700: {
                itemsToShow: 2,
                snapAlign: 'center',
            },
            // 1024 and up
            1024: {
                itemsToShow: 4,
                snapAlign: 'start',
            },
        },
        slides: [
            {
                "id": 1,
                "images": "http://localhost:3000/assets/images/book.png",
                "title": "Информационная система 1С:ИТС",
                "info": "Вы сможете быстро научиться работе в программе «1С» благодаря пошаговым инструкциям, научитесь отправлять электронную отчётность прямо из своей программы и запросто рассчитаете налоги по хозяйственным операциям, верно отразите их в учёте.",
                "info1": "Будете в курсе последних новостей по темам бухгалтерского, налогового и кадрового учета, сможете получить по ним консультации. С лёгкостью составите бухгалтерскую, налоговую отчётность и отчётность по страховым взносам.",
                "info2": "Информационная система 1С: ИТС полезна руководителям, кадровикам, экономистам, бухгалтерам, IT-специалистам коммерческих организаций."
            },
            {
                "id": 2,
                "images": "http://localhost:3000/assets/images/internet.png",
                "title": "1С: Предприятие 8 через Интернет",
                "info": "Облачный сервис, который позволяет работать с привычными программами 1С через интернет с любого устройства. ",
                "info1": "Ведите бухгалтерский, налоговый, управленческий учет, сдавайте отчетность.",
                "info2": "Он особенно удобен, если бухучет ведется на аутсорсинге, частo приходится работать удаленно из дома, нужно быстро автоматизировать работу или объединить несколько филиалов."
            },
            {
                "id": 3,
                "images": "http://localhost:3000/assets/images/update.png",
                "title": "1С: Обновление программ",
                "info": "Позволяет:",
                "info1": "Получить информацию о плановом графике выпуска новых версий прикладных программ и технологической платформы;",
                "info2": "Получить информацию о плановых изменениях функционала, которые сделаны в новой версии программы;",
                "info3": "Узнать какая версия программногo продукта актуальна на текущий момент, скачать дистрибутивы для вашей версии продукта на актуальную;",
                "info4": "Получить информацию о списке ошибок, которые зарегистрированы и будут исправляться в следующих версиях программ;",
                "info5": "Скачать разные дополнительные файлы, рекомендованные разработчиками программных продуктов для использования."
            },
            {
                "id": 4,
                "images": "http://localhost:3000/assets/images/link.png",
                "title": "1С: Линк",
                "info": "Простой способ организации удаленного подключения через Интернет к приложениям 1С, установленным на компьютере или сервере пользователя.",
                "info1": "Сервис не требует специальных знаний или наличия системного администратора. ",
                "info2": "Получить информацию о плановых изменениях функционала, которые сделаны в новой версии программы; Настроить доступ через «1С: Линк» можно самостоятельно за несколько минут. Не придется вносить какие-либо изменения в настройки компьютера или покупать дополнительное оборудование."
            },
            {
                "id": 5,
                "images": "http://localhost:3000/assets/images/cloud.png",
                "title": "1С: Обновление программ",
                "info": "Это инструмент для защиты баз данных «1С: Предприятие 8» посредством автоматизированного периодического копирования и архивирования на удаленных серверах в «облачном» хранилище.",
                "info1": "1С: Облачный архив поможет вам: -защитить базы данных от случайной утери из-за выхода из строя оборудования, программных сбоев, «человеческого фактора»;",
                "info2": "-переключить внимание на действительно важные для вас вещи: «1С: Облачный архив» самостоятельно проконтролирует выполнение и успешное завершение копирования баз данных в хранилище;",
                "info3": "-получать информацию о результатах работы агента резервного копирования при входе в базу «1С: Предприятие»."
            },
            {
                "id": 6,
                "images": "http://localhost:3000/assets/images/support.png",
                "title": "1С: Коннект",
                "info": "Общайтесь с коллегами где и когда удобно",
                "info1": "Сервис 1С-Коннект работает на мобильных устройствах и на компьютере как отдельное приложение или через браузер. Вы можете быть на связи с компанией или отделом где угодно – на рабочем месте, в дороге или из дома, видеть список коллег, писать и звонить нужными сотрудникам.",
                "info2": "Организуйте групповую работу",
                "info3": "Создавайте группы для отдела или участников проекта. Обменивайтесь файлами, организуйте совместные конференции, обсуждайте текущие дела и планы. Запись разговора и поиск по истории переписок помогут вспомнить важные детали проекта.",
                "info4": "Оперативно получайте поддержку",
                "info5": "Совет коллеги в чате не помог? Попросите помощь через удаленное подключение к вашему компьютеру: пусть вам покажут, как решить проблему прямо на вашем ПК. Удаленный доступ осуществляется только с вашего разрешения и под вашим контролем. Если вы используете программные продукты «1С: Предприятие», подключайте в 1С-Коннект линии поддержки партнеров фирмы «1С», операторов сервисов 1С: ИТС и отраслевых решений. Поддержку через 1С-Коннект предоставляют более 5 000 партнеров фирмы «1С».",
                "info6": "Будьте на связи со всей компанией",
                "info7": "Необходимо получить согласование от коллеги из другого отдела? Совсем не обязательно писать письмо и ждать, когда он обработает почту. Найдите коллегу в списке, напишите ему запрос в чате и получите оперативный ответ",
            },
            {
                "id": 7,
                "images": "http://localhost:3000/assets/images/bank.png",
                "title": "1С: ДиректБанк",
                "info": "Pаботает на технологии «DirectBank», позволяющей отправлять документы в банк и получать их непосредственно из программ «1С» при помощи одной кнопки.",
                "info1": "Работа с расчетными счетами, открытыми в разных банках, выполняется одинаково – не нужно изучать программу «Клиент-Банк» различных банков.",
                "info2": "Документы в программе 1С подписываются электронной подписью и передаются в банк по шифрованным каналам – все операции надежно защищены как со стороны «1С», так и со стороны банка.",
                "info3": "Сервис отслеживает этапы отправки платежа и показывает их в программе 1С – процесс под вашим контролем.",
            },
            {
                "id": 8,
                "images": "http://localhost:3000/assets/images/touch.png",
                "title": "1С: Контрагент",
                "info": "Автоматическое заполнение реквизитов контрагента. Введите БИН любой фирмы или ИИН ИП и карточка агента заполнена моментально и без ошибок",
                "info1": "Актуальные адресные сведения теперь можно не заносить в программу вручную, а получать с помощью сервиса «1С: Контрагент для Казахстана»",
                "info2": "Отчет «Досье контрагента» покажет регистрационные сведения статистики МНЭ РК, сведения о наличии в реестрах благонадежности государственных доходов МФ РК и т.д.",
            },
            {
                "id": 9,
                "images": "http://localhost:3000/assets/images/answer.png",
                "title": "Отвечает аудитор",
                "info": "Задайте вопрос по учету и в течение семи рабочих дней получите ответ аудитора или методиста фирмы «1С».",
                "info1": "Задать вопрос можно в Личном кабинете сайта its.1c.kz",
            },
        ]
        
    }),
})
</script>

<style lang="scss" scoped>
.slider {
    width: 100%;
    &-item {
        padding: 20px;
        background-color: #F5AC6D;
        border: none;
        overflow: hidden;
        cursor: pointer;
        align-items: flex-start;
        &__cnt {
        width: 280px;
        height: 500px;
         transition: .7s;
            p {
                text-align: left;
            }

        }
        :hover {
            height: auto;
            overflow: visible;
            white-space: normal;
            transition: .7s;
            transform: translateY(-10px);
        }
    }
    

}
</style>

